name: "CaffeNet"
layer{
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "E:/dataset/ilsvcr12/train_leveldb"
    mean_file: "E:/dataset/ilsvcr12/mean.binaryproto"
    batch_size: 64
    crop_size: 180
    mirror: true
  }
  include: { phase: TRAIN }
}
layer{
  name: "data"
  type: "Data"
  top: "data"
  top: "label"
  data_param {
    source: "E:/dataset/ilsvcr12/val_leveldb"
    mean_file: "E:/dataset/ilsvcr12/mean.binaryproto"
    batch_size: 64
    crop_size: 180
    mirror: false
  }
  include: { phase: TEST }
}
layer{
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 96
    kernel_size: 7
	pad:3
    stride: 2
    weight_filler {
      type: "gaussian"
	  std:0.01
    }
    bias_term: false
  }
}
layer{
  name: "relu1"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer{
  name: "pool1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer{
  name: "norm1"
  type: "LRN"
  bottom: "pool1"
  top: "norm1"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer{
  name: "conv2"
  type: "Convolution"
  bottom: "norm1"
  top: "conv2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
    kernel_size: 5
    stride: 2
    weight_filler {
      type: "gaussian"
	  std:0.01
    }
    bias_term: false
  }  
}
layer{
  name: "relu2"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer{
  name: "pool2"
  type: "Pooling"
  bottom: "conv2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
  }
}
layer{
  name: "norm2"
  type: "LRN"
  bottom: "pool2"
  top: "norm2"
  lrn_param {
    local_size: 5
    alpha: 0.0001
    beta: 0.75
  }
}
layer{
  name: "conv3"
  type: "Convolution"
  bottom: "norm2"
  top: "conv3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 384
	pad:1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
	  std:0.01
    }
    bias_term: false
  }    
}
layer{
  name: "relu3"
  type: "ReLU"
  bottom: "conv3"
  top: "conv3"
}
layer{
  name: "conv4"
  type: "Convolution"
  bottom: "conv3"
  top: "conv4"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 384
	pad:1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
	  std:0.01
    }
    bias_term: false
  }    
}
layer{
  name: "relu4"
  type: "ReLU"
  bottom: "conv4"
  top: "conv4"
}
layer{
  name: "conv5"
  type: "Convolution"
  bottom: "conv4"
  top: "conv5"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  convolution_param {
    num_output: 256
	pad:1
    kernel_size: 3
    weight_filler {
      type: "gaussian"
	  std:0.01
    }
    bias_term: false
  }    
}
layer{
  name: "relu5"
  type: "ReLU"
  bottom: "conv5"
  top: "conv5"
}

layer{
  name: "pool3_1"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3_1"
  pooling_param {
    pool: MAX
    kernel_size: 10
    stride: 10
  }
}

layer{
  name: "pool3_2"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3_2"
  pooling_param {
    pool: MAX
    kernel_size: 6
    stride: 4
  }
}

layer{
  name: "pool3_3"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3_3"
  pooling_param {
    pool: MAX
    kernel_size:4
    stride: 3
  }
}

layer{
  name: "pool3_4"
  type: "Pooling"
  bottom: "conv5"
  top: "pool3_4"
  pooling_param {
    pool: MAX
    kernel_size:5
    stride: 1
  }
}

layer {
  name: "pool3"
  bottom: "pool3_1_flatt"
  bottom: "conv3_2_flatt"
  bottom: "pool3_3_flatt"
  bottom: "pool3_4_flatt"
  top: "pool3"
  type: "Concat"
  concat_param {
    axis: 1
  }
 }

layer{
  name: "fc6"
  type: "InnerProduct"
  bottom: "pool3"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer{
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer{
  name: "drop6"
  type: "Dropout"
  bottom: "fc6"
  top: "fc6"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer{
  name: "fc7"
  type: "InnerProduct"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  inner_product_param {
    num_output: 4096
    weight_filler {
      type: "gaussian"
      std: 0.005
    }
    bias_filler {
      type: "constant"
      value: 1
    }
  }
}
layer{
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer{
  name: "drop7"
  type: "Dropout"
  bottom: "fc7"
  top: "fc7"
  dropout_param {
    dropout_ratio: 0.5
  }
}
layer{
  name: "fc8"
  type: "InnerProduct"
  bottom: "fc7"
  top: "fc8"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  inner_product_param {
    num_output: 1000
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer{
  name: "loss"
  type: "SoftmaxWithLoss"
  bottom: "fc8"
  bottom: "label"
  include: { phase: TRAIN }
}

layer {
  name: "accuracy"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy"
}
layer {
  name: "accuracy_top5"
  type: "Accuracy"
  bottom: "fc8"
  bottom: "label"
  top: "accuracy_top5"
  accuracy_param {
    top_k: 5
  }
}
